config.org
#+TITLE: literate config
#+AUTHOR: zhafacai
#+EMAIL: zhafacai@gmail.com
#+STARTUP: content
#+PROPERTY: header-args:emacs-lisp :tangle yes

This repo consists of guix and emacs configuration.
* Guix
** The =art.scm= section for Lenovo AHP9 system
#+begin_src scheme :tangle zfc/system/art.scm
;; -*- mode: scheme; -*-
(define-module (zfc system art)
  #:use-module (gnu)
  #:use-module (gnu system nss)
  #:use-module (gnu packages wm)
  #:use-module (gnu packages shells)
  #:use-module (gnu packages gnome)
  #:use-module (gnu packages vim)
  #:use-module (gnu services desktop)
  #:use-module (gnu services xorg)
  #:use-module (gnu services virtualization)
  #:use-module (gnu services guix)
  #:use-module (gnu home)
  #:use-module (gnu home services)
  #:use-module (guix packages)
  #:use-module (guix channels)
  #:use-module (nongnu packages linux)
  #:use-module (nongnu system linux-initrd)
  #:use-module (zfc home base))
;; (use-service-modules desktop sddm xorg)

(define %subs-services
  ;; my service to use substituters
  (modify-services %desktop-services
		   (guix-service-type
		    config => (guix-configuration
			       (inherit config)
			       (authorized-keys
				(append (list (local-file "./signing-key.pub")
					      (plain-file "guix-moe.pub"
							  "(public-key (ecc (curve Ed25519) (q #552F670D5005D7EB6ACF05284A1066E52156B51D75DE3EBD3030CD046675D543#)))"))
					%default-authorized-guix-keys))
			       (substitute-urls '("https://mirror.sjtu.edu.cn/guix/"
						  "https://cache-cdn.guix.moe"
						  "https://substitutes.nonguix.org"
						  "https://ci.guix.gnu.org"))))))

(operating-system
 (kernel linux)
 (initrd microcode-initrd)
 (firmware (list linux-firmware))
 (host-name "art")
 (timezone "Asia/Shanghai")
 (locale "en_US.utf8")

 ;; Choose US English keyboard layout.  The "altgr-intl"
 ;; variant provides dead keys for accented characters.
 (keyboard-layout (keyboard-layout "us"))

 ;; Use the UEFI variant of GRUB with the EFI System
 ;; Partition mounted on /boot/efi.
 (bootloader (bootloader-configuration
              (bootloader grub-efi-bootloader)
              (targets '("/boot/efi"))
              (keyboard-layout keyboard-layout)))

 ;; Specify a mapped device for the encrypted root partition.
 ;; The UUID is that returned by 'cryptsetup luksUUID'.
 (mapped-devices
  (list (mapped-device
         (source (uuid "5212f095-4ef7-4584-b9f1-93cb96ae6714"))
         (target "cryptroot")
         (type luks-device-mapping))))

 (file-systems (append
                (list (file-system
                       (device (file-system-label "cryptroot"))
                       (mount-point "/")
                       (type "ext4")
                       (dependencies mapped-devices))
                      (file-system
                       (device (uuid "7429-C291" 'fat))
                       (mount-point "/boot/efi")
                       (type "vfat")))
                %base-file-systems))

 ;; Specify a swap file for the system, which resides on the
 ;; root file system.
 (swap-devices (list (swap-space
                      (target "/swapfile"))))

 (users (cons (user-account
               (name "zfc")
               (comment "zhafacai")
               (group "users")
               (password (crypt ";'" "$6$saltydisk"))
               (supplementary-groups '("wheel" "netdev"
				       "libvirt"
                                       "audio" "video")))
              %base-user-accounts))


 ;; This is where we specify system-wide packages.
 (packages (append (list
		    neovim
		    niri
		    xdg-desktop-portal-gnome
                    gvfs)
                   %base-packages))

 (services (append (list (service gnome-desktop-service-type)
			 (service bluetooth-service-type)
			 (service libvirt-service-type
				  (libvirt-configuration))
			 (service virtlog-service-type
				  (virtlog-configuration))
			 (service guix-home-service-type
				  `(("zfc" ,home-base)))
			 polkit-wheel-service
			 (set-xorg-configuration
			  (xorg-configuration
			   (keyboard-layout keyboard-layout))))
		   %subs-services))

 ;; Allow resolution of '.local' host names with mDNS.
 (name-service-switch %mdns-host-lookup-nss))
#+end_src
** The =base.scm= section for =guix home=
#+begin_src scheme :tangle zfc/home/base.scm :noweb yes
(define-module (zfc home base)
  #:use-module (gnu packages)
  #:use-module (gnu packages gnupg)
  #:use-module (gnu packages fcitx5)
  #:use-module (gnu services)
  #:use-module (gnu home)
  #:use-module (gnu home services)
  #:use-module (gnu home services shells)
  #:use-module (gnu home services guix)
  #:use-module (gnu home services gnupg)
  #:use-module (gnu home services desktop)
  #:use-module (rosenthal services desktop)
  #:use-module (guix gexp)
  #:use-module (guix channels)
  #:use-module (guix transformations)
  #:use-module (zfc home packages rime-ice)
  #:export (home-base))

(define transform1
  (options->transformation '((with-branch . "emacs-reader=master"))))

(define home-base
  (home-environment
   ;; Below is the list of packages that will show up in your
   ;; Home profile, under ~/.guix-home/profile.
   (packages (append (list (transform1 (specification->package "emacs-reader")))
		     (specifications->packages (list
						;; emacs
						<<epkgs>>
						"emacs-pgtk"
						
						;; fonts
						"font-google-noto-emoji"
						"font-aporetic"
						"font-iosevka-ss02"
						"font-nerd-symbols"
						"font-lxgw-wenkai"

						"librewolf"
						"google-chrome-stable"
						"noctalia-shell"
						"virt-manager"
						
						;; cli
						"starship"
						"make"
						"unzip"
						"zoxide"
						"btop"
						"yt-dlp"
						"ripgrep"
						"fd"
						"openssh"
						"mpv"
						"alacritty"
						"fish"
						"gcc-toolchain@14"
						"gnome-tweaks"
						"git"
						"mihomo"
						"file"
						"vim"
						"neofetch"
						"curl"
						"cryptsetup"))))

   (services
    (append (list (service home-bash-service-type
			   (home-bash-configuration
			    (aliases '())
			    (environment-variables '(("EDITOR" . "emacsclient")))
			    (bashrc (list (local-file "plain/.bashrc" "bashrc")))
			    (bash-profile (list (local-file
						 "plain/.bash_profile"
						 "bash_profile")))))
                  (service home-gpg-agent-service-type
			   (home-gpg-agent-configuration
			    (pinentry-program
                             (file-append pinentry-emacs "/bin/pinentry-emacs"))
			    (ssh-support? #t)))

		  <<hm-services>>

		  )
            %base-home-services))))
#+end_src
*** The =base.scm= section about fcitx5
~hm-services~
#+begin_src scheme :noweb-ref hm-services
(service home-files-service-type
  `(
    ;; 1. Link the heavy data directories
    (".local/share/fcitx5/rime/en_dicts" ,(file-append rime-ice "/share/rime-data/en_dicts"))
    (".local/share/fcitx5/rime/cn_dicts" ,(file-append rime-ice "/share/rime-data/cn_dicts"))
    (".local/share/fcitx5/rime/opencc" ,(file-append rime-ice "/share/rime-data/opencc"))
    (".local/share/fcitx5/rime/lua"    ,(file-append rime-ice "/share/rime-data/lua"))

    ;; 2. Link the essential schema files for Xiaohe
    (".local/share/fcitx5/rime/double_pinyin_flypy.schema.yaml" 
     ,(file-append rime-ice "/share/rime-data/double_pinyin_flypy.schema.yaml"))
    (".local/share/fcitx5/rime/rime_ice.schema.yaml" 
     ,(file-append rime-ice "/share/rime-data/rime_ice.schema.yaml"))
    (".local/share/fcitx5/rime/default.yaml" 
     ,(file-append rime-ice "/share/rime-data/default.yaml"))
    (".local/share/fcitx5/rime/rime_ice.dict.yaml" 
     ,(file-append rime-ice "/share/rime-data/rime_ice.dict.yaml"))
    (".local/share/fcitx5/rime/symbols_v.yaml" 
     ,(file-append rime-ice "/share/rime-data/symbols_v.yaml"))
    (".local/share/fcitx5/rime/symbols_caps_v.yaml" 
     ,(file-append rime-ice "/share/rime-data/symbols_caps_v.yaml"))
    (".local/share/fcitx5/rime/default.custom.yaml"
     ,(local-file "packages/default.custom.yaml"))))
(service home-dbus-service-type)
(service home-fcitx5-service-type
  (home-fcitx5-configuration
    (gtk-im-module? #t)
    (qt-im-module? #t)
    (themes
     (list fcitx5-material-color-theme))
    (input-method-editors
     (list fcitx5-rime))))
#+end_src
patch to use flypy
#+begin_src yaml :tangle zfc/home/packages/default.custom.yaml
patch:
  __include: rime_ice_suggestion:/
  schema_list:
    - schema: double_pinyin_flypy # 小鹤
#+end_src
=rime-ice= module for guix home
#+begin_src scheme :tangle zfc/home/packages/rime-ice.scm
(define-module (zfc home packages rime-ice)
  #:use-module (guix packages)
  #:use-module (guix git-download)
  #:use-module (guix build-system copy)
  #:use-module ((guix licenses) #:prefix license:)
  #:export (rime-ice))

(define rime-ice
  (package
   (name "rime-ice")
   (version "master")
   (source (origin
	    (method git-fetch)
	    (uri (git-reference
		  (url "https://github.com/iDvel/rime-ice")
		  (commit "23f0c39a0b443524e37dbff4f085236b32691291")))
	    (sha256
	     (base32 "0jfdw277z5cynb906i2m24iasgj3an7r1gsrbx3hy9gymm9yvbv3"))))
   (build-system copy-build-system)
   (arguments
    '(#:install-plan '(("." "share/rime-data" #:exclude ("README.md" "LICENSE")))))
   (home-page "https://github.com")
   (synopsis "Rime 雾凇拼音")
   (description "Rime 配置：雾凇拼音 | 长期维护的简体词库 ")
   (license license:gpl3+)))
#+end_src
*** The =base.scm= section about channels
~hm-services~
#+begin_src scheme :noweb-ref hm-services
(simple-service 'variant-packages-service
    home-channels-service-type
  (list
   (channel
     (inherit (car %default-channels))
     (url "https://mirror.sjtu.edu.cn/git/guix.git"))
   (channel
     (name 'nonguix)
     (url "https://gitlab.com/nonguix/nonguix")
     (introduction
      (make-channel-introduction
       "897c1a470da759236cc11798f4e0a5f7d4d59fbc"
       (openpgp-fingerprint
        "2A39 3FFF 68F4 EF7A 3D29  12AF 6F51 20A0 22FB B2D5"))))
   (channel
     (name 'rosenthal)
     (url "https://codeberg.org/hako/rosenthal.git")
     (branch "trunk")
     (introduction
      (make-channel-introduction
       "7677db76330121a901604dfbad19077893865f35"
       (openpgp-fingerprint
        "13E7 6CD6 E649 C28C 3385  4DF5 5E5A A665 6149 17F7"))))
   (channel
     (name 'divya-lambda)
     (url "https://codeberg.org/divyaranjan/divya-lambda.git")
     (branch "master")
     (introduction
      (make-channel-introduction
       "fe2010125fcbe003de42436b1a73ab53cc5e8288"
       (openpgp-fingerprint
        "F0B3 1A69 8006 8FB8 096A  2F12 B245 10C6 108C 8D4A"))))))
#+end_src
* Emacs
** The =early-init.el= section
seems conflict with straight.el
#+begin_src emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil)
#+end_src
** The =init.el= section
I have some os to use,maybe drop support for these
#+begin_src emacs-lisp :tangle init.el
;;; -*- lexical-binding: t; -*-
(defconst fc/is-windows (eq system-type 'windows-nt))
(defconst fc/is-linux   (eq system-type 'gnu/linux))

;; -----------------------
;; Linux 发行版判断
;; -----------------------
(defun fc/linux-distro ()
  "Return a symbol identifying the Linux distribution."
  (when fc/is-linux
    (cond
     ;; ArchLinux (检测 arch-release 文件)
     ((file-exists-p "/etc/arch-release") 'arch)
     ;; NixOS
     ((file-exists-p "/etc/nixos") 'nixos)
     ;; Guix
     ((file-exists-p "/etc/guix") 'guix)
     ;; fallback
     (t 'linux))))

(defconst fc/is-nixos  (eq (fc/linux-distro) 'nixos))
(defconst fc/is-guix   (eq (fc/linux-distro) 'guix))
(defconst fc/is-arch   (eq (fc/linux-distro) 'arch))

(setq inhibit-startup-message t

      ;; No backup files, please
      make-backup-files nil

      ;; Don't warn on large files
      large-file-warning-threshold nil

      ;; Follow symlinks to VC-controlled files without warning
      vc-follow-symlinks t

      ;; Silence compiler warnings as they can be pretty disruptive
      native-comp-async-report-warnings-errors nil)
(auto-save-visited-mode 1)     ;; Auto-save files at an interval
(load-file (expand-file-name "config.el" user-emacs-directory))
#+end_src
** The =config.el= section
*** Setup
setup mirror for elpa
#+begin_src emacs-lisp
(setq package-archives '(("gnu" . "https://mirrors.ustc.edu.cn/elpa/gnu/")
			 ("melpa" . "https://mirrors.ustc.edu.cn/elpa/melpa/")
			 ("nongnu" . "https://mirrors.ustc.edu.cn/elpa/nongnu/")))
#+end_src
**** Straight
bootstrap
#+begin_src emacs-lisp :tangle yes
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
	"straight/repos/straight.el/bootstrap.el"
	(or (bound-and-true-p straight-base-dir)
	    user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+end_src
use org from straight
#+begin_src emacs-lisp :tangle yes

(straight-use-package 'org)
#+end_src
windows normal users cannot create symlinks
#+begin_src emacs-lisp :tangle (if fc/is-windows "config.el" "no")
(setq use-package-always-ensure t)
#+end_src
disable package.el
#+begin_src emacs-lisp :tangle early-init.el
(setq package-enable-at-startup nil)
#+end_src

install use-package support
#+begin_src emacs-lisp :tangle yes
;; Install use-package support

(straight-use-package 'use-package)
#+end_src
use straight by default
#+begin_src emacs-lisp :tangle yes
(setq straight-use-package-by-default t)
#+end_src
I do not  want any dashboard/splash screen.
#+begin_src emacs-lisp :tangle yes
(setq initial-buffer-choice t)
(setq initial-major-mode 'lisp-interaction-mode)
(setq initial-scratch-message
      (format ";; This is `%s'.  Type `%s' to evaluate and print results.\n\n"
              'lisp-interaction-mode
              (propertize
               (substitute-command-keys "\\<lisp-interaction-mode-map>\\[eval-print-last-sexp]")
               'face 'help-key-binding)))
#+end_src
**** Shell
$SHELL has to be POSIX one
#+begin_src emacs-lisp :tangle yes
;; Instruct Emacs to use a posix shell under the hood...
(setq shell-file-name (executable-find "bash"))

;; But use your normal shell in terminal emulators
(setq-default vterm-shell (executable-find "fish"))
(setq-default explicit-shell-file-name (executable-find "fish"))
#+end_src

